zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F83xxx/periph/PERI_INTC.h
/*
** ###################################################################
**     Processors:          MC56F83663VLH
**                          MC56F83683VLH
**                          MC56F83686VLK
**                          MC56F83689VLL
**                          MC56F83763AVLH
**                          MC56F83763VLH
**                          MC56F83766VLK
**                          MC56F83769AVLL
**                          MC56F83769VLL
**                          MC56F83783AVLH
**                          MC56F83783VLH
**                          MC56F83786VLK
**                          MC56F83789AVLL
**                          MC56F83789VLL
**
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for INTC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2019-09-23)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_INTC.h
 * @version 1.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for INTC
 *
 * CMSIS Peripheral Access Layer for INTC
 */

#if !defined(PERI_INTC_H_)
#define PERI_INTC_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F83663VLH))
#include "MC56F83663_COMMON.h"
#elif (defined(CPU_MC56F83683VLH))
#include "MC56F83683_COMMON.h"
#elif (defined(CPU_MC56F83686VLK))
#include "MC56F83686_COMMON.h"
#elif (defined(CPU_MC56F83689VLL))
#include "MC56F83689_COMMON.h"
#elif (defined(CPU_MC56F83763AVLH) || defined(CPU_MC56F83763VLH))
#include "MC56F83763_COMMON.h"
#elif (defined(CPU_MC56F83766VLK))
#include "MC56F83766_COMMON.h"
#elif (defined(CPU_MC56F83769AVLL) || defined(CPU_MC56F83769VLL))
#include "MC56F83769_COMMON.h"
#elif (defined(CPU_MC56F83783AVLH) || defined(CPU_MC56F83783VLH))
#include "MC56F83783_COMMON.h"
#elif (defined(CPU_MC56F83786VLK))
#include "MC56F83786_COMMON.h"
#elif (defined(CPU_MC56F83789AVLL) || defined(CPU_MC56F83789VLL))
#include "MC56F83789_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(VECTOR_TYPE_T_)
#define VECTOR_TYPE_T_
/*!
 * @addtogroup Interrupt_vector_numbers
 * @{
 */

/*!
 * @brief Structure for the vector table
 *
 * The vector table refer to interrupt vector table in RM
 * Generally used for fast interrupt setting, checking current interrupt type.
 */
typedef enum _vector_type
{
    kHW_RESET_VECTORn               = 0,           /**< Vector no.0 */
    kCOP_RESET_VECTORn              = 1,           /**< Vector no.1 */
    kILLEGAL_OP_VECTORn             = 2,           /**< Vector no.2 */
    kSWI3_VECTORn                   = 3,           /**< Vector no.3 */
    kOVERFLOW_VECTORn               = 4,           /**< Vector no.4 */
    kMISALIGNED_VECTORn             = 5,           /**< Vector no.5 */
    kSTPCNT_VECTORn                 = 6,           /**< Vector no.6 */
    kBKPT_VECTORn                   = 7,           /**< Vector no.7 */
    kTRBUF_VECTORn                  = 8,           /**< Vector no.8 */
    kTX_REG_VECTORn                 = 9,           /**< Vector no.9 */
    kRX_REG_VECTORn                 = 10,          /**< Vector no.10 */
    kBUS_ERR_VECTORn                = 11,          /**< Vector no.11 */
    kReserved12_VECTORn             = 12,          /**< Vector no.12 */
    kReserved13_VECTORn             = 13,          /**< Vector no.13 */
    kReserved14_VECTORn             = 14,          /**< Vector no.14 */
    kSWI2_VECTORn                   = 15,          /**< Vector no.15 */
    kSWI1_VECTORn                   = 16,          /**< Vector no.16 */
    kSWI0_VECTORn                   = 17,          /**< Vector no.17 */
    kXBARA_VECTORn                  = 18,          /**< Vector no.18 */
    kLVI1_VECTORn                   = 19,          /**< Vector no.19 */
    kOCCS_VECTORn                   = 20,          /**< Vector no.20 */
    kTMRB_3_VECTORn                 = 21,          /**< Vector no.21 */
    kTMRB_2_VECTORn                 = 22,          /**< Vector no.22 */
    kTMRB_1_VECTORn                 = 23,          /**< Vector no.23 */
    kTMRB_0_VECTORn                 = 24,          /**< Vector no.24 */
    kTMRA_3_VECTORn                 = 25,          /**< Vector no.25 */
    kTMRA_2_VECTORn                 = 26,          /**< Vector no.26 */
    kTMRA_1_VECTORn                 = 27,          /**< Vector no.27 */
    kTMRA_0_VECTORn                 = 28,          /**< Vector no.28 */
    kADC12_CC1_VECTORn              = 29,          /**< Vector no.29 */
    kADC12_CC0_VECTORn              = 30,          /**< Vector no.30 */
    kADC12_ERR_VECTORn              = 31,          /**< Vector no.31 */
    kDMA_ERR_VECTORn                = 32,          /**< Vector no.32 */
    kDMA3_VECTORn                   = 33,          /**< Vector no.33 */
    kDMA2_VECTORn                   = 34,          /**< Vector no.34 */
    kDMA1_VECTORn                   = 35,          /**< Vector no.35 */
    kDMA0_VECTORn                   = 36,          /**< Vector no.36 */
    kCAN_MB_OR_VECTORn              = 37,          /**< Vector no.37 */
    kCAN_BUS_OFF_VECTORn            = 38,          /**< Vector no.38 */
    kCAN_ERROR_VECTORn              = 39,          /**< Vector no.39 */
    kCAN_TX_WARN_VECTORn            = 40,          /**< Vector no.40 */
    kCAN_RX_WARN_VECTORn            = 41,          /**< Vector no.41 */
    kCAN_WAKEUP_VECTORn             = 42,          /**< Vector no.42 */
    kReserved43_VECTORn             = 43,          /**< Vector no.43 */
    kQSCI2_RERR_VECTORn             = 43,          /**< Vector no.43 */
    kReserved44_VECTORn             = 44,          /**< Vector no.44 */
    kQSCI2_RCV_VECTORn              = 44,          /**< Vector no.44 */
    kReserved45_VECTORn             = 45,          /**< Vector no.45 */
    kQSCI2_TRIDLE_VECTORn           = 45,          /**< Vector no.45 */
    kReserved46_VECTORn             = 46,          /**< Vector no.46 */
    kQSCI2_TDRE_VECTORn             = 46,          /**< Vector no.46 */
    kQSCI1_RERR_VECTORn             = 47,          /**< Vector no.47 */
    kQSCI1_RCV_VECTORn              = 48,          /**< Vector no.48 */
    kQSCI1_TRIDLE_VECTORn           = 49,          /**< Vector no.49 */
    kQSCI1_TDRE_VECTORn             = 50,          /**< Vector no.50 */
    kQSCI0_RERR_VECTORn             = 51,          /**< Vector no.51 */
    kQSCI0_RCV_VECTORn              = 52,          /**< Vector no.52 */
    kQSCI0_TRIDLE_VECTORn           = 53,          /**< Vector no.53 */
    kQSCI0_TDRE_VECTORn             = 54,          /**< Vector no.54 */
    kReserved55_VECTORn             = 55,          /**< Vector no.55 */
    kReserved56_VECTORn             = 56,          /**< Vector no.56 */
    kReserved57_VECTORn             = 57,          /**< Vector no.57 */
    kQSPI1_XMIT_VECTORn             = 57,          /**< Vector no.57 */
    kReserved58_VECTORn             = 58,          /**< Vector no.58 */
    kQSPI1_RCV_VECTORn              = 58,          /**< Vector no.58 */
    kQSPI0_XMIT_VECTORn             = 59,          /**< Vector no.59 */
    kQSPI0_RCV_VECTORn              = 60,          /**< Vector no.60 */
    kI2C1_VECTORn                   = 61,          /**< Vector no.61 */
    kI2C0_VECTORn                   = 62,          /**< Vector no.62 */
    kReserved63_VECTORn             = 63,          /**< Vector no.63 */
    kReserved64_VECTORn             = 64,          /**< Vector no.64 */
    kReserved65_VECTORn             = 65,          /**< Vector no.65 */
    keFlexPWMB_FAULT_VECTORn        = 66,          /**< Vector no.66 */
    keFlexPWMB_RERR_VECTORn         = 67,          /**< Vector no.67 */
    keFlexPWMB_CAP_VECTORn          = 68,          /**< Vector no.68 */
    keFlexPWMB_RELOAD3_VECTORn      = 69,          /**< Vector no.69 */
    keFlexPWMB_CMP3_VECTORn         = 70,          /**< Vector no.70 */
    keFlexPWMB_RELOAD2_VECTORn      = 71,          /**< Vector no.71 */
    keFlexPWMB_CMP2_VECTORn         = 72,          /**< Vector no.72 */
    keFlexPWMB_RELOAD1_VECTORn      = 73,          /**< Vector no.73 */
    keFlexPWMB_CMP1_VECTORn         = 74,          /**< Vector no.74 */
    keFlexPWMB_RELOAD0_VECTORn      = 75,          /**< Vector no.75 */
    keFlexPWMB_CMP0_VECTORn         = 76,          /**< Vector no.76 */
    keFlexPWMA_FAULT_VECTORn        = 77,          /**< Vector no.77 */
    keFlexPWMA_RERR_VECTORn         = 78,          /**< Vector no.78 */
    keFlexPWMA_CAP_VECTORn          = 79,          /**< Vector no.79 */
    keFlexPWMA_RELOAD3_VECTORn      = 80,          /**< Vector no.80 */
    keFlexPWMA_CMP3_VECTORn         = 81,          /**< Vector no.81 */
    keFlexPWMA_RELOAD2_VECTORn      = 82,          /**< Vector no.82 */
    keFlexPWMA_CMP2_VECTORn         = 83,          /**< Vector no.83 */
    keFlexPWMA_RELOAD1_VECTORn      = 84,          /**< Vector no.84 */
    keFlexPWMA_CMP1_VECTORn         = 85,          /**< Vector no.85 */
    keFlexPWMA_RELOAD0_VECTORn      = 86,          /**< Vector no.86 */
    keFlexPWMA_CMP0_VECTORn         = 87,          /**< Vector no.87 */
    kFTFE_RDCOL_VECTORn             = 88,          /**< Vector no.88 */
    kFTFE_CC_VECTORn                = 89,          /**< Vector no.89 */
    kCMPD_VECTORn                   = 90,          /**< Vector no.90 */
    kCMPC_VECTORn                   = 91,          /**< Vector no.91 */
    kCMPB_VECTORn                   = 92,          /**< Vector no.92 */
    kCMPA_VECTORn                   = 93,          /**< Vector no.93 */
    kPIT1_ROLLOVR_VECTORn           = 94,          /**< Vector no.94 */
    kPIT0_ROLLOVR_VECTORn           = 95,          /**< Vector no.95 */
    kFTFE_DFD_VECTORn               = 96,          /**< Vector no.96 */
    kReserved97_VECTORn             = 97,          /**< Vector no.97 */
    kReserved98_VECTORn             = 98,          /**< Vector no.98 */
    kReserved99_VECTORn             = 99,          /**< Vector no.99 */
    kReserved100_VECTORn            = 100,         /**< Vector no.100 */
    kGPIOG_VECTORn                  = 101,         /**< Vector no.101 */
    kGPIOF_VECTORn                  = 102,         /**< Vector no.102 */
    kGPIOE_VECTORn                  = 103,         /**< Vector no.103 */
    kGPIOD_VECTORn                  = 104,         /**< Vector no.104 */
    kGPIOC_VECTORn                  = 105,         /**< Vector no.105 */
    kGPIOB_VECTORn                  = 106,         /**< Vector no.106 */
    kGPIOA_VECTORn                  = 107,         /**< Vector no.107 */
    kCOP_INT_VECTORn                = 108,         /**< Vector no.108 */
    kEWM_INT_VECTORn                = 109,         /**< Vector no.109 */
    kSWILP_VECTORn                  = 110,         /**< Vector no.110 */
    kReserved111_VECTORn            = 111,         /**< Vector no.111 */
    kUSB_VECTORn                    = 111,         /**< Vector no.111 */
} vector_type_t;

/* @} */
#endif /* VECTOR_TYPE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


